OldDemo/1c-esb/TestClient/TestComposite/src/jbiServiceUnits/TestComposite.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="TestComposite"
             xmlns:tns="TestComposite" xmlns:ns="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExecuteRequest" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExecuteScript" xmlns:ns2="http://j2ee.netbeans.org/wsdl/TestBPEL/TestMethod" xmlns:ns3="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExchange">
    <import namespace="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExecuteRequest" location="../jbiServiceUnits/TestBPEL/TestExecuteRequest.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExecuteScript" location="../jbiServiceUnits/TestBPEL/TestExecuteScript.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/TestBPEL/TestMethod" location="../jbiServiceUnits/TestBPEL/TestMethod.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/TestBPEL/TestExchange" location="../jbiServiceUnits/TestBPEL/TestExchange.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="testRequestBinding" type="ns:TestExecuteRequestPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ExecuteRequest">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="TestComposite"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="TestComposite"/>
            </output>
        </operation>
    </binding>
    <binding name="testScriptBinding" type="ns1:TestExecuteScriptPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ExecuteScript">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="TestComposite"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="TestComposite"/>
            </output>
        </operation>
    </binding>
    <binding name="testMethodBinding" type="ns2:TestMethodPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ExecuteMethod">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="TestComposite"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="TestComposite"/>
            </output>
        </operation>
    </binding>
    <binding name="testExchangeBinding" type="ns3:TestExchangePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="Exchange">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="TestComposite"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="TestComposite"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="testRequestPort" binding="tns:testRequestBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService1/testRequestPort"/>
        </port>
    </service>
    <service name="casaService2">
        <port name="testScriptPort" binding="tns:testScriptBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService2/casaPort1"/>
        </port>
    </service>
    <service name="casaService3">
        <port name="testMethodPort" binding="tns:testMethodBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService3/casaPort1"/>
        </port>
    </service>
    <service name="casaService4">
        <port name="testExchangePort" binding="tns:testExchangeBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/casaService4/casaPort1"/>
        </port>
    </service>
</definitions>
