trunk/OldDemo/1c-esb/TestClient/TestComposite/test/TestRequest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="TestComposite">
  <soapenv:Body>
    <tes:ExecuteRequest>
      <request>ВЫБРАТЬ С.Ссылка ИЗ Справочник.Сотрудники КАК С</request>
    </tes:ExecuteRequest>
  </soapenv:Body>
</soapenv:Envelope>