OldDemo/1c-esb/TestClient/TestComposite/test/TestScript/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="TestComposite">
  <soapenv:Body>
    <tes:ExecuteScript>
      <script>результат=2+3;</script>
    </tes:ExecuteScript>
  </soapenv:Body>
</soapenv:Envelope>